In [1]:
import pandas as pd

# Missing data

For numeric data, pandas uses the floating-point value NaN (Not a Number) to represent missing data. We call this a sentinel value that can be easily detected:

In [2]:
string_data = pd.Series(['aardvark' ,'artichoke', np.nan, 'avocado'])

In [3]:
string_data

0     aardvark
1    artichoke
2          NaN
3      avocado
dtype: object

In [4]:
string_data.isnull()

0    False
1    False
2     True
3    False
dtype: bool

The built-in Python None value is also treated as NA in object arrays:

In [5]:
string_data[0] = None

In [6]:
string_data.isnull()

0     True
1    False
2     True
3    False
dtype: bool

![na_methods](https://github.com/Zlisu/Notes/blob/master/Images/NumPy/na_methods.PNG?raw=True)

## filtering out missing data


### series
.dropna() returns the Series with only the non-null data and index values:

In [7]:
from numpy import nan as NA

In [8]:
data = pd.Series([1, NA, 3.5, NA, 7])

In [9]:
data.dropna()

0    1.0
2    3.5
4    7.0
dtype: float64

In [10]:
data[data.notnull()]

0    1.0
2    3.5
4    7.0
dtype: float64

### data frame
.dropna() by default drops any row containing a missing value:

In [11]:
data = pd.DataFrame([[1., 6.5, 3.], [1., NA, NA],
                     [NA, NA, NA], [NA, 6.5, 3.]])

In [12]:
cleaned = data.dropna()

In [13]:
data

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

In [14]:
cleaned

     0    1    2
0  1.0  6.5  3.0

Passing how='all' will only drop rows that are all NA:

In [15]:
data.dropna(how='all')

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
3  NaN  6.5  3.0

To drop columns in the same way, pass axis=1:

In [16]:
data[4] = NA

In [17]:
data

     0    1    2   4
0  1.0  6.5  3.0 NaN
1  1.0  NaN  NaN NaN
2  NaN  NaN  NaN NaN
3  NaN  6.5  3.0 NaN

In [18]:
data.dropna(axis=1, how='all')

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

Suppose you want to keep only rows containing a certain number of observations. You can
indicate this with the thresh argument:

In [19]:
df = pd.DataFrame(np.random.randn(7, 3))

In [22]:
df.iloc[:4, 1] = NA

In [23]:
df.iloc[:2, 2] = NA

In [24]:
df

          0         1         2
0  0.063101       NaN       NaN
1  0.147086       NaN       NaN
2  0.574172       NaN -0.925233
3  0.725631       NaN -0.794804
4 -0.478607  0.666046  1.032444
5 -1.077313  0.015526  0.045344
6  1.915629  0.837090 -0.987991

In [25]:
df.dropna()

          0         1         2
4 -0.478607  0.666046  1.032444
5 -1.077313  0.015526  0.045344
6  1.915629  0.837090 -0.987991

In [27]:
df.dropna(thresh=2)

          0         1         2
2  0.574172       NaN -0.925233
3  0.725631       NaN -0.794804
4 -0.478607  0.666046  1.032444
5 -1.077313  0.015526  0.045344
6  1.915629  0.837090 -0.987991

## filling in missing data

Calling fillna with a constant replaces missing values with that value:

In [28]:
df.fillna(0)

          0         1         2
0  0.063101  0.000000  0.000000
1  0.147086  0.000000  0.000000
2  0.574172  0.000000 -0.925233
3  0.725631  0.000000 -0.794804
4 -0.478607  0.666046  1.032444
5 -1.077313  0.015526  0.045344
6  1.915629  0.837090 -0.987991

Calling fillna with a dict, you can use a different fill value for each column:

In [29]:
df.fillna({1:0.5, 2:0})

          0         1         2
0  0.063101  0.500000  0.000000
1  0.147086  0.500000  0.000000
2  0.574172  0.500000 -0.925233
3  0.725631  0.500000 -0.794804
4 -0.478607  0.666046  1.032444
5 -1.077313  0.015526  0.045344
6  1.915629  0.837090 -0.987991

fillna returns a new object, but you can modify the existing object in-place:

In [30]:
_ = df.fillna(0, inplace=True)

In [31]:
df

          0         1         2
0  0.063101  0.000000  0.000000
1  0.147086  0.000000  0.000000
2  0.574172  0.000000 -0.925233
3  0.725631  0.000000 -0.794804
4 -0.478607  0.666046  1.032444
5 -1.077313  0.015526  0.045344
6  1.915629  0.837090 -0.987991

The same interpolation methods available for reindexing can be used with fillna:

In [32]:
df = pd.DataFrame(np.random.randn(6, 3))

In [33]:
df.iloc[2:, 1] = NA

In [34]:
df.iloc[4:, 2] = NA

In [35]:
df

          0         1         2
0 -1.397676  0.059667  0.004562
1 -0.570001 -0.815001 -0.128779
2  0.021980       NaN  0.836397
3 -0.039814       NaN -0.885223
4  0.551251       NaN       NaN
5 -1.226454       NaN       NaN

In [36]:
df.fillna(method='ffill')

          0         1         2
0 -1.397676  0.059667  0.004562
1 -0.570001 -0.815001 -0.128779
2  0.021980 -0.815001  0.836397
3 -0.039814 -0.815001 -0.885223
4  0.551251 -0.815001 -0.885223
5 -1.226454 -0.815001 -0.885223

In [37]:
df.fillna(method='ffill', limit=2)

          0         1         2
0 -1.397676  0.059667  0.004562
1 -0.570001 -0.815001 -0.128779
2  0.021980 -0.815001  0.836397
3 -0.039814 -0.815001 -0.885223
4  0.551251       NaN -0.885223
5 -1.226454       NaN -0.885223

you
might pass the mean or median value of a Series:

In [39]:
data = pd.Series([1., NA, 3.5, NA, 7])

In [40]:
data

0    1.0
1    NaN
2    3.5
3    NaN
4    7.0
dtype: float64

In [41]:
data.fillna(data.mean())

0    1.000000
1    3.833333
2    3.500000
3    3.833333
4    7.000000
dtype: float64

![fillna](https://github.com/Zlisu/Notes/blob/master/Images/NumPy/fillna.PNG?raw=True)

# Data transformation

## removing duplicates

In [45]:
data = pd.DataFrame({'k1':['one', 'two'] * 3 + ['two'],
                     'k2':[1, 1, 2, 3, 3, 4, 4]})

In [46]:
data

    k1  k2
0  one   1
1  two   1
2  one   2
3  two   3
4  one   3
5  two   4
6  two   4

In [48]:
# The DataFrame method duplicated returns a boolean Series indicating 
# whether each row is a duplicate (has been observed in a previous row) or not

data.duplicated()

0    False
1    False
2    False
3    False
4    False
5    False
6     True
dtype: bool

In [49]:
# drop_duplicates returns a DataFrame 
# where the duplicated array is False:

data.drop_duplicates()

    k1  k2
0  one   1
1  two   1
2  one   2
3  two   3
4  one   3
5  two   4

Both of these methods by default consider all of the columns; alternatively, you can specify any subset of them to detect duplicates.

In [50]:
data['v1'] = range(7)

In [51]:
data

    k1  k2  v1
0  one   1   0
1  two   1   1
2  one   2   2
3  two   3   3
4  one   3   4
5  two   4   5
6  two   4   6

In [52]:
data.drop_duplicates(['k1'])

    k1  k2  v1
0  one   1   0
1  two   1   1

In [53]:
#  row 

data.drop_duplicates(['k1', 'k2'], keep='last')

    k1  k2  v1
0  one   1   0
1  two   1   1
2  one   2   2
3  two   3   3
4  one   3   4
6  two   4   6

## function or mapping

In [54]:
data = pd.DataFrame({'food': [ 'bacon', 'pulled pork', 'bacon',
                               'Pastrami', 'corned beef', 'Bacon',
                               'pastrami', 'honey ham', 'nova lox'],
                     'ounces': [4,3,12,6,7.5,8,3,5,6]})

In [55]:
data

          food  ounces
0        bacon     4.0
1  pulled pork     3.0
2        bacon    12.0
3     Pastrami     6.0
4  corned beef     7.5
5        Bacon     8.0
6     pastrami     3.0
7    honey ham     5.0
8     nova lox     6.0

Suppose you wanted to add a column indicating the type of animal that each food came from. Lets write down a mapping of each distinct meat type to the kind of animal:

In [61]:
meat_to_animal = {
    'bacon':'pig',
    'pulled pork':'pig',
    'pastrami':'cow',
    'corned beef':'cow',
    'honey ham':'pig',
    'nova lox':'salmon'
}

In [62]:
# covert to lower case

lowercased = data['food'].str.lower()

In [63]:
lowercased

0          bacon
1    pulled pork
2          bacon
3       pastrami
4    corned beef
5          bacon
6       pastrami
7      honey ham
8       nova lox
Name: food, dtype: object

In [64]:
data['animal'] = lowercased.map(meat_to_animal)

In [65]:
data

          food  ounces  animal
0        bacon     4.0     pig
1  pulled pork     3.0     pig
2        bacon    12.0     pig
3     Pastrami     6.0     cow
4  corned beef     7.5     cow
5        Bacon     8.0     pig
6     pastrami     3.0     cow
7    honey ham     5.0     pig
8     nova lox     6.0  salmon

We could also have passed a function that does all the work:

In [66]:
data['food'].map(lambda x: meat_to_animal[x.lower()])

0       pig
1       pig
2       pig
3       cow
4       cow
5       pig
6       cow
7       pig
8    salmon
Name: food, dtype: object

## replacing values